console.log("Здравствуй как дела?");
/*
undefined - не инициализированные значения.
null - флаг нулевого значения.
bool(Boolen) - лоический тип данных, true или false .
string - последовательность символов (или символ), объединённые в структуру.
number - число (любого вида), NaN(Not-a-Number), Infinity(-Infinity),(+0(-0)).
object - представление объекта языка JavaScript.
Декремент
++x или х++ <=> x+1
Инкремент
--x или x-- <=> x-1
*/
// alert("Укажите Ваше имя");
let ans;
ans = prompt("Укажите Ваше имя");
alert("Ваше имя - " + ans);